In [10]:
import pandas as pd
import numpy as np

Pandas Documentation
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html

In [ ]:
data = pd.DataFrame({"Order_No": ["Ord1","Ord1","Ord2","Ord2","Ord2","Ord3","Ord3","Ord3","Ord4"], 
    "Product_Name": ["Apple","Banana","Grape","Apple","Mango","Banana","Grape","Apple","Cherries"],
    "Product_Quantly": [1,10,4,6,5,4,5,6,7],
    "Price_per_Piece" : [10,2,20,10,45,2,20,10,100]})
data

In [ ]:
#Display a summary of the basic information about this DataFrame and its data 
data.shape

In [ ]:
data.info()

In [ ]:
data.describe()

In [11]:
data.head()

  Order_No Product_Name  Product_Quantly  Price_per_Piece
0     Ord1        Apple                1               10
1     Ord1       Banana               10                2
2     Ord2        Grape                4               20
3     Ord2        Apple                6               10
4     Ord2        Mango                5               45

# Indexing

In [23]:
data.iloc[[1]]

  Order_No Product_Name  Product_Quantly  Price_per_Piece
1     Ord1       Banana               10                2

In [16]:
data['Product_Name']

0       Apple
1      Banana
2       Grape
3       Apple
4       Mango
5      Banana
6       Grape
7       Apple
8    Cherries
Name: Product_Name, dtype: object

In [24]:
data.iloc[2]

Order_No            Ord2
Product_Name       Grape
Product_Quantly        4
Price_per_Piece       20
Name: 2, dtype: object

In [25]:
data.iloc[[2,4],[1,2]]

  Product_Name  Product_Quantly
2        Grape                4
4        Mango                5

In [ ]:
data.iloc[[2,4],[True,False,True,False]]

In [26]:
data["Product_Name"]

0       Apple
1      Banana
2       Grape
3       Apple
4       Mango
5      Banana
6       Grape
7       Apple
8    Cherries
Name: Product_Name, dtype: object

# Set Index

In [34]:
data_index = data.set_index("Order_No")
data_index

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1            Apple                1               10
Ord1           Banana               10                2
Ord2            Grape                4               20
Ord2            Apple                6               10
Ord2            Mango                5               45
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10
Ord4         Cherries                7              100

In [35]:
data_index.iloc[1]

Product_Name       Banana
Product_Quantly        10
Price_per_Piece         2
Name: Ord1, dtype: object

In [ ]:
q = 10

In [36]:
data_index.loc["Ord3"]

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10

In [37]:
data_index.loc[["Ord1","Ord2"]]

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1            Apple                1               10
Ord1           Banana               10                2
Ord2            Grape                4               20
Ord2            Apple                6               10
Ord2            Mango                5               45

In [38]:
data_index

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1            Apple                1               10
Ord1           Banana               10                2
Ord2            Grape                4               20
Ord2            Apple                6               10
Ord2            Mango                5               45
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10
Ord4         Cherries                7              100

In [39]:
data_index.loc['Ord1'] = 10

In [40]:
data_index

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1               10               10               10
Ord1               10               10               10
Ord2            Grape                4               20
Ord2            Apple                6               10
Ord2            Mango                5               45
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10
Ord4         Cherries                7              100

In [41]:
data_index.loc['Ord2',"Product_Quantly"] = 100

In [42]:
data_index

         Product_Name  Product_Quantly  Price_per_Piece
Order_No
Ord1               10               10               10
Ord1               10               10               10
Ord2            Grape              100               20
Ord2            Apple              100               10
Ord2            Mango              100               45
Ord3           Banana                4                2
Ord3            Grape                5               20
Ord3            Apple                6               10
Ord4         Cherries                7              100

In [44]:
data

  Order_No Product_Name  Product_Quantly  Price_per_Piece
0     Ord1        Apple                1               10
1     Ord1       Banana               10                2
2     Ord2        Grape                4               20
3     Ord2        Apple                6               10
4     Ord2        Mango                5               45
5     Ord3       Banana                4                2
6     Ord3        Grape                5               20
7     Ord3        Apple                6               10
8     Ord4     Cherries                7              100

## Selecting Data

In [43]:
data.Order_No == "Ord1"

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: Order_No, dtype: bool

In [49]:
data[(data.Product_Name == "Apple")]

  Order_No Product_Name  Product_Quantly  Price_per_Piece
0     Ord1        Apple                1               10
3     Ord2        Apple                6               10
7     Ord3        Apple                6               10

## Creating New Fields

In [50]:
data['Price'] = data['Product_Quantly']*data['Price_per_Piece']

In [51]:
data

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price
0     Ord1        Apple                1               10     10
1     Ord1       Banana               10                2     20
2     Ord2        Grape                4               20     80
3     Ord2        Apple                6               10     60
4     Ord2        Mango                5               45    225
5     Ord3       Banana                4                2      8
6     Ord3        Grape                5               20    100
7     Ord3        Apple                6               10     60
8     Ord4     Cherries                7              100    700

## Grouping

In [52]:
data.groupby(['Order_No']).sum()

          Product_Quantly  Price_per_Piece  Price
Order_No
Ord1                   11               12     30
Ord2                   15               75    365
Ord3                   15               32    168
Ord4                    7              100    700

In [57]:
data.groupby(['Product_Name'])[['Product_Quantly','Price_per_Piece']].sum()

              Product_Quantly  Price_per_Piece
Product_Name
Apple                      13               30
Banana                     14                4
Cherries                    7              100
Grape                       9               40
Mango                       5               45

In [62]:
def sum1(x):
    return np.sum(x)+100

In [59]:
data.groupby(['Product_Name']).agg({"Product_Quantly":["sum","count"],"Price_per_Piece":"mean"})

             Product_Quantly       Price_per_Piece
                         sum count            mean
Product_Name
Apple                     13     3              10
Banana                    14     2               2
Cherries                   7     1             100
Grape                      9     2              20
Mango                      5     1              45

In [64]:
data.groupby(['Product_Name','Order_No']).agg({"Product_Quantly":[sum1,"count"],"Price_per_Piece":"mean"})

                      Product_Quantly       Price_per_Piece
                                 sum1 count            mean
Product_Name Order_No
Apple        Ord1                 101     1              10
             Ord2                 106     1              10
             Ord3                 106     1              10
Banana       Ord1                 110     1               2
             Ord3                 104     1               2
Cherries     Ord4                 107     1             100
Grape        Ord2                 104     1              20
             Ord3                 105     1              20
Mango        Ord2                 105     1              45

In [ ]:
data.groupby(['Order_No']).min()

In [56]:
data.groupby(['Product_Name'])['Price'].sum()

Product_Name
Apple       130
Banana       28
Cherries    700
Grape       180
Mango       225
Name: Price, dtype: int64

In [ ]:
data.groupby(['Order_No']).agg({"Product_Quantly": ["count","min"],
                               "Price": ['sum']})

## Questions 

### 1 - Write code to get quantity of each fruit sold 
### 2 - Total Sales 
### 3 - Total Orders

## Merging

In [75]:
customer_info = pd.DataFrame({"Order_No" : ["Ord1","Ord2","Ord3","Ord5"],
                              "Customer_Name" : ["John","Rob","Bob","Mike"],
                              "Price":[10,3,4,5]})
customer_info

  Order_No Customer_Name  Price
0     Ord1          John     10
1     Ord2           Rob      3
2     Ord3           Bob      4
3     Ord5          Mike      5

In [72]:
data

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price
0     Ord1        Apple                1               10     10
1     Ord1       Banana               10                2     20
2     Ord2        Grape                4               20     80
3     Ord2        Apple                6               10     60
4     Ord2        Mango                5               45    225
5     Ord3       Banana                4                2      8
6     Ord3        Grape                5               20    100
7     Ord3        Apple                6               10     60
8     Ord4     Cherries                7              100    700

# How much John purchased?

In [77]:
data_merge_inner = data.merge(customer_info,  on = ['Order_No'], how = "inner")
data_merge_inner

,Order_No,Product_Name,Product_Quantly,Price_per_Piece,Price_x,Customer_Name,Price_y
0,Ord1,Apple,1,10,10,John,10
1,Ord1,Banana,10,2,20,John,10
2,Ord2,Grape,4,20,80,Rob,3
3,Ord2,Apple,6,10,60,Rob,3
4,Ord2,Mango,5,45,225,Rob,3
5,Ord3,Banana,4,2,8,Bob,4
6,Ord3,Grape,5,20,100,Bob,4
7,Ord3,Apple,6,10,60,Bob,4

In [68]:
data_merge_left = data.merge(customer_info,  on = ['Order_No'], how = "left")
data_merge_left

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price Customer_Name
0     Ord1        Apple                1               10     10          John
1     Ord1       Banana               10                2     20          John
2     Ord2        Grape                4               20     80           Rob
3     Ord2        Apple                6               10     60           Rob
4     Ord2        Mango                5               45    225           Rob
5     Ord3       Banana                4                2      8           Bob
6     Ord3        Grape                5               20    100           Bob
7     Ord3        Apple                6               10     60           Bob
8     Ord4     Cherries                7              100    700           NaN

In [69]:
data_merge_right = data.merge(customer_info,  on = ['Order_No'], how = "right")
data_merge_right

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price Customer_Name
0     Ord1        Apple              1.0             10.0   10.0          John
1     Ord1       Banana             10.0              2.0   20.0          John
2     Ord2        Grape              4.0             20.0   80.0           Rob
3     Ord2        Apple              6.0             10.0   60.0           Rob
4     Ord2        Mango              5.0             45.0  225.0           Rob
5     Ord3       Banana              4.0              2.0    8.0           Bob
6     Ord3        Grape              5.0             20.0  100.0           Bob
7     Ord3        Apple              6.0             10.0   60.0           Bob
8     Ord5          NaN              NaN              NaN    NaN          Mike

In [70]:
data_merge_outer = data.merge(customer_info,  on = ['Order_No'], how = "outer")
data_merge_outer

  Order_No Product_Name  Product_Quantly  Price_per_Piece  Price Customer_Name
0     Ord1        Apple              1.0             10.0   10.0          John
1     Ord1       Banana             10.0              2.0   20.0          John
2     Ord2        Grape              4.0             20.0   80.0           Rob
3     Ord2        Apple              6.0             10.0   60.0           Rob
4     Ord2        Mango              5.0             45.0  225.0           Rob
5     Ord3       Banana              4.0              2.0    8.0           Bob
6     Ord3        Grape              5.0             20.0  100.0           Bob
7     Ord3        Apple              6.0             10.0   60.0           Bob
8     Ord4     Cherries              7.0            100.0  700.0           NaN
9     Ord5          NaN              NaN              NaN    NaN          Mike

## Questions 
### 1 -> No. of orders in which customer information is missing

In [78]:
df1 = pd.DataFrame({"Name":["Shubham","Kapil"],
                   "Gender": ["M","M"]})
df1

      Name Gender
0  Shubham      M
1    Kapil      M

In [81]:
df2 = pd.DataFrame({"Name":["Sachi","Krishna","Shubham"],
                   "Gender": ["F","M","M"]})
df2

      Name Gender
0    Sachi      F
1  Krishna      M
2  Shubham      M

In [85]:
pd.concat([df1,df2], axis=0)

      Name Gender
0  Shubham      M
1    Kapil      M
0    Sachi      F
1  Krishna      M
2  Shubham      M

In [86]:
pd.concat([df1,df2], axis=1)

      Name Gender     Name Gender
0  Shubham      M    Sachi      F
1    Kapil      M  Krishna      M
2      NaN    NaN  Shubham      M

In [87]:
df3 = pd.DataFrame({"Course":["ML","DS"]})
df3

  Course
0     ML
1     DS

In [88]:
pd.concat([df1,df3], axis=0)

      Name Gender Course
0  Shubham      M    NaN
1    Kapil      M    NaN
0      NaN    NaN     ML
1      NaN    NaN     DS

In [ ]:
df2 = pd.DataFrame({"Name":["Dev","Shikha","Shubham"],
                   "Gender1": ["M","F","M"],
                   "Account": [1000,2000,3000]})
df2

In [ ]:
pd.concat([df1,df2], axis=0)

In [ ]:
data

In [ ]:
data.pivot_table(index = "Order_No", columns = "Product_Name", values = "Price_per_Piece", aggfunc = "sum")

In [ ]:
data

In [ ]:
data.iloc[4]

In [ ]:
data_index = data.set_index(['Order_No'])
data_index

In [ ]:
data_index.loc[["Ord3","Ord1"]]

In [ ]:
data[(data.Order_No == "Ord1") & (data.Product_Name == "Apple") ]

In [ ]:
data[(data.Order_No.isin(["Ord1","Ord2"])) & (data.Product_Name == "Apple") ]